# 1
673

# 2
512.0

# 3
192

# 4
178.0

# 5
193.000000000001 == str

# 6
'''
конкатенация это математические операции с разными видами типов данных
превращая их в себе удобных типов данных
пример:

print:'Calling ' + str(911)
print:'abc' + 'xyz'

Calling 911
abcxyz

'''

# 7
'''

a = 589
b = 932.901
c = 'Hello world'
d = '892.01'

print:a + b
print:c + d

1521.9009999999998
Hello world892.01

'''

# 8

a = 589
b = 932.901
c = 'Hello world'
d = '892.01'

'''

print:(c + str(a)+' '+ d +' '+ str(b) + str(a) + ' ' + str(b + a - 40 - 0000.9009999999998))

Hello world589 892.01 932.901589 1481.1

'''