#1. У вас есть кортеж из N элементов или последовательность, которую вы хотите распаковать в коллекцию из N переменных

n = (4, 5)

# a,b = n
# print(a,b)

##########################################
data = ['ACME', 50, 91.1, (2021, 12, 21),"ACME, 50, 91.1"]

a, *p, q,  = data
print(p)


# e, s, t = r
# print(e)
# print(s)
# print(t)


##########################################
world = 'Hello'

##########################################
record = ('Kuma', 'kuma04@example.com', '773-555-112', '555-555-212')
some, mail, *phones = record
print(phones)


kuma = 'Kuma:kuma04@example.com:773-555-112:555-555-212'

print(kuma.split(':'))


